## DATA FRAME - TABLE

## SERIES - ROW OR COLUMN

In [2]:
import numpy as np
import pandas as pd

In [3]:
a = ['karunesh', 'bansal', 'varun']

In [4]:
a = pd.DataFrame(a)

In [5]:
a

          0
0  karunesh
1    bansal
2     varun

In [6]:
b = ['karunesh', 'bansal', 'anjali']

In [7]:
b = pd.DataFrame(b, index=["A", "B", "C"], columns=["students"])

In [8]:
b

   students
A  karunesh
B    bansal
C    anjali

In [9]:
type(b)

pandas.core.frame.DataFrame

In [10]:
type(b['students'])

pandas.core.series.Series

## MULTIPLE SERIES

In [11]:
names = ['shubham', 'abhi', 'akash']
marks = [20,30,40]

In [12]:
pd.DataFrame([names, marks])

         0     1      2
0  shubham  abhi  akash
1       20    30     40

In [13]:
pd.DataFrame(names, marks )

          0
20  shubham
30     abhi
40    akash

In [14]:
row1 = ["shubham", 30, 'doctor', 90.4]
row2 = ["abhi", 26, 'cleaner', 45.4]
row3 = ["akash", 44, 'support', 88.2]

In [15]:
a = [row1, row2, row3]

In [16]:
b = np.array([row1, row2, row3])

In [17]:
a

[['shubham', 30, 'doctor', 90.4],
 ['abhi', 26, 'cleaner', 45.4],
 ['akash', 44, 'support', 88.2]]

In [18]:
b

array([['shubham', '30', 'doctor', '90.4'],
       ['abhi', '26', 'cleaner', '45.4'],
       ['akash', '44', 'support', '88.2']], dtype='<U32')

In [19]:
pd.DataFrame(a)

         0   1        2     3
0  shubham  30   doctor  90.4
1     abhi  26  cleaner  45.4
2    akash  44  support  88.2

In [20]:
pd.DataFrame(b)

         0   1        2     3
0  shubham  30   doctor  90.4
1     abhi  26  cleaner  45.4
2    akash  44  support  88.2

In [21]:
indexes = "A B C".split()

In [22]:
columns = "name age work weight".split()

In [23]:
df = pd.DataFrame(a, index= indexes, columns= columns)

In [24]:
df

      name  age     work  weight
A  shubham   30   doctor    90.4
B     abhi   26  cleaner    45.4
C    akash   44  support    88.2

## putting data through dictionary

In [25]:
d = {
    1: ["shubham" , 20, 'netmax', 63.6, "np"],
    2: ["abhi" , 40, 'dev', 65.8, None],
    3: ["akash" , 50, 'data', 73.1, None]
    
}

In [26]:
d

{1: ['shubham', 20, 'netmax', 63.6, 'np'],
 2: ['abhi', 40, 'dev', 65.8, None],
 3: ['akash', 50, 'data', 73.1, None]}

In [27]:
pd.DataFrame(d)

         1     2      3
0  shubham  abhi  akash
1       20    40     50
2   netmax   dev   data
3     63.6  65.8   73.1
4       np  None   None

In [28]:
d = {
    "name": ["shubham" , "abhi", "akash"],
    "age": [20, 25, 30],
    "weight": [63.3, 52.0, 41.7]
    
}

In [29]:
df = pd.DataFrame(d, index=range(100, 103))

In [30]:
df

        name  age  weight
100  shubham   20    63.3
101     abhi   25    52.0
102    akash   30    41.7